In [2]:
import pandas as pd

In [17]:
df = pd.read_csv('data/household-income-and-housing-cost-statistics-year-ended-june-2018-csv/HES2018-Table3and4.csv')
df.head()

,Table,Year,Sex,IncomeCode,IncomeDescription,Mean,MeanFlag,MeanRse,Median,MedianFlag,MedianRse
0,T3,2007,11,10,0wages and salaries,43607,NaN,5.5,40046,NaN,3.9
1,T3,2007,11,11,1self-employment,44805,*,23.6,33480,NaN,12.2
2,T3,2007,11,12,2investments,6187,*,28.1,1175,*,23.4
3,T3,2007,11,13,3private superannuation,21365,*,25.3,17095,NaN,11.6
4,T3,2007,11,14,4New Zealand Superannuation and war pensions,12682,NaN,3.3,12393,NaN,1.6